[
  {
    "name": "Механика",
    "id": 1,
    "children":
 [
  {
    "id": 2,
    "name": "Закон Архимеда",
    "diff": "2",
    "additional": "Закон test",
    "data": "\nЗакон гидро- и аэростатики: на тело, погруженное в жидкость или газ, действует выталкивающая сила, направленная вертикально вверх, числено равная весу жидкости или газа, вытесненного телом, и приложенная в центре тяжести погруженной части тела. \n\n ### $F_\\alpha = \\rho gV$\n\nгде $\\rho$ - плотность жидкости или газа, $V$ - объем погруженной части тела, $g$ - Ускорение свободного падения. \n\nИначе можно сформулировать так: тело, погруженное в жидкость или газ, теряет в своем весе столько, сколько весит вытесненная им жидкость (или газ). Открыт др. гр. ученым Архимедом в 212г. до н.э. Является основой теории плавания тел.\n\n"

  },
  {
    "id": 3,
    "name": "Закон всемирного тяготения",
    "additional": "",
    "data": "Закон, описывающий гравитационное взаимодействие в рамках классической механики. Этот закон был открыт Ньютоном около 1666 года, опубликован в 1687 году в «Началах» Ньютона.\n\nВсе тела притягиваются друг к другу с силой прямо пропорциональной произведению масс этих тел и обратно пропорциональной квадрату расстояния между ними: \n\n ### $F = G\\tfrac{M*m}{R^{2}}$ \n\n где $M$ и $m$ - массы взаимодействующих тел, $R$ - расстояние между этими телами, $G$- гравитационная постоянная \n\n  $G$ $=$ $6,67$ * $10^{-11}$ $H$м$^{2}$/кг$^{2}$"
  },
   {
     "id": 4,
     "name": "Закон сохранения импульса",
     "additional": "",
     "data": "Закон механики: *импульс* любой замкнутой системы при всех процессах, происходящих в системе, остается постоянным (сохраняется) и может только перераспределяться между частями системы в результате их взаимодействия.\n\nСоответственно, векторная сумма импульсов тел, образующих замкнутую систему, не меняется при любых взаимодействиях между телами системы.\n\n Импульс тела (материальной точки): \n\n ### $P = m\\nu$ \n\n Импульс системы тела равен векторной сумме импульсов каждого из тел системы: \n\n ### $p_{s} = \\sum_{i=1}^{N}(p_i)$ \n\n $⇒$  Закон сохранения импульса при неупругом ударе:\n ### $m_1\\nu_1+ m_2\\nu _2 = (m_1 + m_2)\\nu$ \n Закон сохранения импульса при упругом ударе:\n\n ### $m_1 \\nu_1+ m_2\\nu _2 = m_1\\nu _1{}' + m_2\\nu _2{}'$ \n\n"
   },
   {
     "id": 5,
     "name": "Закон Гука",
     "additional": "",
     "data": "Закон, согласно которому упругие *деформации* прямо пропорциональны вызывающим их внешним воздействиям.\n\nЗакон Гука выполняется только при малых деформациях. При превышении предела пропорциональности связь между силой и деформацией становится нелинейной. Для многих сред закон Гука неприменим даже при малых деформациях.\n\n **$⇒$**\n\nCила упругости, возникающая при деформации тела (растяжение или сжатие пружины), пропорциональна удлинению тела (пружины), и направлена в сторону противоположную направлению перемещений частиц тела\n\n ### $F=k*\\Delta l$ ### \n\nЗдесь $F$ — сила, которой растягивают (сжимают) стержень,  $\\Delta l$ — абсолютное удлинение (сжатие) стержня, а $k$  — коэффициент упругости (или жёсткости).\n\nЗакон Гука лежит в основе измерения сил пружинным механическим динамометром. В этом приборе измеряемая сила передаётся пружине, которая в зависимости от направления силы сжимается или растягивается. Величина упругой деформации пружины пропорциональна силе воздействия и регистрируется.\n\nПринципиальная возможность измерения обеспечивается уже свойством упругости, но без закона Гука упомянутая пропорциональность отсутствовала бы и градуировочная шкала стала бы неравномерной, что неудобно.\n\n"
   },
   {
     "id": 6,
     "name": "Первый закон Ньютона",
     "additional": "",
     "data": "Первый закон Ньютона постулирует существование инерциальных систем отсчёта. Поэтому он также известен как **закон инерции**. \n\nИнерция (она же инертность) — свойство тела сохранять скорость своего движения неизменной по величине и направлению, когда не действуют никакие силы, а также свойство тела сопротивляться изменению его скорости. \n\nЧтобы изменить скорость движения тела, необходимо приложить некоторую силу, причём результат действия одной и той же силы на разные тела будет различным: тела обладают разной инерцией (инертностью), величина которой характеризуется их массой.\n\nВ современной физике первый закон Ньютона принято формулировать в следующем виде:\n\n ```    Существуют такие системы отсчёта, называемые инерциальными, относительно которых материальные точки, когда на них не действуют никакие силы (или действуют силы взаимно уравновешенные), находятся в состоянии покоя или равномерного прямолинейного движения.```"
   },
   {
     "id": 7,
     "name": "Второй закон Ньютона",
     "additional": "",
     "data": "Второй закон Ньютона — дифференциальный закон движения, описывающий взаимосвязь между приложенной к материальной точке силой и получающимся от этого ускорением этой точки. \n\nФактически, второй закон Ньютона вводит массу как меру проявления инертности материальной точки в выбранной инерциальной системе отсчёта (ИСО). Масса материальной точки при этом полагается величиной постоянной во времени и независящей от каких-либо особенностей её движения и взаимодействия с другими телами\n\n ```В инерциальной системе отсчёта ускорение, которое получает материальная точка с постоянной массой, прямо пропорционально равнодействующей всех приложенных к ней сил и обратно пропорционально её массе.``` \n\n ### $\\vec{a}= \\frac{F}{m}$ ### \n\nгде  $\\vec{a}$ — ускорение материальной точки; $F$ — равнодействующая всех, приложенных к материальной точке;  $m$ — материальной точки.\n\nВторой закон Ньютона может быть также сформулирован в эквивалентной форме с использованием понятия импульс:\n\n *В инерциальной системе отсчёта скорость изменения импульса материальной точки равна равнодействующей всех приложенных к ней внешних сил.* \n\n $\\frac{d\\vec{p}}{dt} = \\vec{F}$ \n"
   },
   {
     "id": 8,
     "name": "Третий закон Ньютона",
     "additional": "",
     "data": "Этот закон описывает, как взаимодействуют две материальные точки. Пусть имеется замкнутая система, состоящая из двух материальных точек, в которой первая точка может действовать на вторую с некоторой силой  ${\\displaystyle {\\vec {F}}_{1\\to 2}}$ , а вторая — на первую с силой ${\\displaystyle {\\vec {F}}_{2\\to 1}}$. \n\nТретий закон Ньютона утверждает: сила действия ${\\displaystyle {\\vec {F}}_{1\\to 2}}$ равна по модулю и противоположна по направлению силе противодействия  ${\\displaystyle {\\vec {F}}_{2\\to 1}}$.\n\nЗакон утверждает, что силы возникают лишь попарно, причём любая сила, действующая на тело, имеет источник происхождения в виде другого тела. Иначе говоря, сила всегда есть результат *взаимодействия* тел. Существование сил, возникших самостоятельно, без взаимодействующих тел, невозможно\n\n ```Материальные точки взаимодействуют друг с другом силами, имеющими одинаковую природу, направленными вдоль прямой, соединяющей эти точки, равными по модулю и противоположными по направлению:```\n\n ### ${\\displaystyle {\\vec {F}}_{2\\to 1}} = -{\\displaystyle {\\vec {F}}_{1\\to 2}}$ ### \n\n\n"
   },
   {
     "id": 9,
     "name": "Принцип относительности Эйнштейна",
     "additional": "",
     "data": "Фундаментальный физический принцип, один из принципов симметрии, согласно которому все физические процессы в инерциальных системах отсчёта протекают *одинаково*, независимо от того, неподвижна ли система или она находится в состоянии равномерного и прямолинейного движения.\n\nОтсюда следует, что все законы природы одинаковы во всех инерциальных системах отсчёта. Частным случаем принципа относительности Эйнштейна является принцип относительности Галилея, который утверждает то же самое, но не для всех законов природы, а только для законов классической механики, подразумевая применимость преобразований Галилея и оставляя открытым вопрос о применимости принципа относительности к оптике и электродинамике.\n\nИз определения ускорения следует, что если движущаяся система отсчёта движется относительно первой без ускорения, то есть ${\\displaystyle \\ a_{o}=o}$, то ускорение ${\\displaystyle {\\vec {a}}}$ тела относительно обеих систем отсчёта одинаково. \n\nПоскольку в Ньютоновской динамике из кинематических величин именно ускорение играет основную роль, то все уравнения механики запишутся одинаково в любой инерциальной системе отсчёта — иначе говоря, законы механики не зависят от того, в какой из инерциальных систем отсчёта мы их исследуем, не зависят от выбора в качестве рабочей какой-либо конкретной из инерциальных систем отсчёта. Также — поэтому — не зависит от такого выбора системы отсчёта наблюдаемое движение тел (учитывая, конечно, начальные скорости). Это утверждение известно как принцип относительности Галилея, в отличие от Принципа относительности Эйнштейна.\n"
   }
 ]},
  {
  "name":"Молекулярная физика и Термодинамика",
    "id": 10,
    "children": [
      {
        "id": 11,
        "name": "Молекулярно-кинетическая теория",
        "additional": "теория, рассматривающая строение веществ, в основном газов",
        "data": "Теория строения вещества, базирующаяся на следующих положениях: вещество состоит из частиц ничтожно малых размеров, эти частицы находятся в непрерывном хаотическом (тепловом) движении и взаимодействуют друг с другом путём столкновений.\n\nМКТ стала одной из самых успешных физических теорий и была подтверждена целым рядом фактов. Основными доказательствами положений МКТ стали:\n\n- Диффузия\n- Броуновское движение\n- Изменение агрегатных состояний вещества\n\nНа основе МКТ развит целый ряд разделов современной физики, в частности, физическая кинетика и статистическая механика. В этих разделах физики изучаются не только молекулярные (атомные или ионные) системы, находящиеся не только в «тепловом» движении, и взаимодействующие не только через абсолютно упругие столкновения. Термин же молекулярно-кинетическая теория в современной теоретической физике уже практически не используется, хотя он встречается в учебниках по курсу общей физики.\n\n#### Основное уравнение МКТ\n\n${\\displaystyle p={\\frac {1}{3}}m_{0}nv^{2}}$, \n\nгде ${\\displaystyle m_{0}}$ — масса одной молекулы газа, $n$ — концентрация молекул, ${\\displaystyle v^{2}}$ — среднеквадратичная скорость молекул.\n\nРелятивистское выражение для этой формулы имеет следующий вид: \n\n${\\displaystyle p={\\frac {2\\rho c^{2}(\\gamma -1)}{3}}={\\frac {2\\rho c^{2}}{3}}\\left({\\frac {1}{\\sqrt {1-v^{2}/c^{2}}}}-1\\right)\\approx {\\frac {\\rho v^{2}}{3}}}$ \n\nгде ${\\displaystyle \\rho =m_{0}n}$ — плотность движущегося вещества, ${\\displaystyle c}$ — скорость света, ${\\displaystyle \\gamma ={\\frac {1}{\\sqrt {1-v^{2}/c^{2}}}}}$ — Лоренц-фактор.\n\n#### Уравнение среднеквадратичной скорости молекулы\n\nУравнение среднеквадратичной скорости молекулы легко выводится из основного уравнения МКТ для одного моля газа. \n\n${\\displaystyle E_{k}={\\frac {1}{2}}m{\\bar {v^{2}}}={\\frac {3}{2}}kT}$, \n\n${\\displaystyle N_{a}m=M_{r}}$, где ${\\displaystyle M_{r}}$ — молярная масса газа, ${\\displaystyle m}$ — масса молекулы газа.\n"
      },
      {
        "id": 12,
        "name": "Закон Авогадро",
        "additional": "",
        "data": "Закон, согласно которому в равных объёмах различных газов, взятых при одинаковых температурах и давлениях, содержится одно и то же количество молекул. В виде гипотезы был сформулирован в 1811 году Амедео Авогадро.\n\nГипотеза была подтверждена многочисленными экспериментальными исследованиями и поэтому стала называться *законом Авогадро*, став впоследствии  количественной основой современной химии и моллекулярной физики\n\nЗакон Авогадро точно выполняется для идеального газа, а для реальных газов он является тем более точным, чем газ более разреженный.\n\n#### Первое следствие из закона Авогадро\n\nодин моль (одинаковое количество молей) любого газа при одинаковых — изобарных и изотермических — условиях занимает одинаковый объём. Согласно закону Авогадро, одно и то же количество молекул любого газа занимает при одинаковых условиях один и тот же объём. С другой стороны, 1 моль любого вещества содержит (по определению) одинаковое количество частиц  (англ.)рус. (например, молекул). \n\nОтсюда следует, что при определённых температуре и давлении 1 моль любого вещества в газообразном состоянии занимает один и тот же объём. В частности, при нормальных условиях, то есть при 0 °C (273,15 К) и 101,325 кПа, объём 1 моля газа равен 22,413 962 ( $\\approx$ 13) л. \n\nЭту физическую константу называют стандартным молярным объёмом идеального газа и обозначают $V_m$. Найти молярный объём при других температуре и давлении можно с помощью уравнения Клапейрона: \n\n${\\displaystyle V_{\r {m}}={\\frac {RT}{p}}}$, где $R \\approx$ 8,314 Дж $/$ (моль $*$ К) — универсальная газовая постоянная.\n\n#### Второе следствие из закона Авогадро\n\nМолярная масса первого газа равна произведению молярной массы второго газа на относительную плотность первого газа ко второму. Это положение имело важное значение для развития химии, так как оно дает возможность определять молекулярную массу веществ, способных переходить в газообразное или парообразное состояние (см. Атомно-молекулярное учение).\n\nЕсли через μ обозначить молекулярную массу вещества и через ρ′ — его относительную плотность в газообразном состоянии, то отношение μ / ρ′ должно быть постоянным для всех веществ. Опыт показал, что для всех изученных веществ, переходящих в газообразное состояние без разложения, эта постоянная равна 28,9 а.е.м. (атомных единицы массы), если при определении относительную плотность исходить из плотности воздуха; но эта постоянная будет равняться 2 а.е.м., если принять за единицу плотность водорода. \n\nОбозначив эту постоянную, или, что то же, общее для всех газов отношение молекулярной массы к относительной плотности через $C$, мы из формулы имеем с другой стороны ${\\mu}' = {p}'C$. Так как относительная плотность $ρ'$ газа определяется легко, то, подставив её значение в формулу, можно вывести и неизвестную молекулярную массу данного вещества.\n\n"
      },
      {
        "id": 13,
        "name": "Закон Бойля — Мариотта",
        "additional": "",
        "data": "Один из основных газовых законов, экспериментально установленный в 1662 году Робертом Бойлем и независимо переоткрытый Эдмом Мариоттом в 1676 году. Описывает *поведение газа* в изотермическом процессе. С точки зрения современной физики закон представляет собой следствие уравнения Клапейрона — Менделеева.\n\nУтверждение закона Бойля — Мариотта состоит в следующем:\n\n```При постоянных температуре и массе газа произведение давления газа на его объём постоянно.```\n\nВ математической форме это утверждение записывается в виде формулы:\n\n${\\displaystyle pV=C}$\n\nгде ${\\displaystyle p}$ — давление газа; $V$ — объём газа, а $C$ — постоянная в оговоренных условиях величина. В общем случае значение $C$ определяется химической природой, массой и температурой газа.\n\nОчевидно, что если индексом 1 обозначить величины, относящиеся к начальному состоянию газа, а индексом 2 — к конечному, то приведённую формулу можно записать в виде:\n\n${\\displaystyle p_{1}V_{1}=p_{2}V_{2}}$.\n\nИз сказанного и приведённых формул следует вид зависимости давления газа от его объёма в изотермическом процессе: \n\n${\\displaystyle p={\\frac {C}{V}}}$ \n\nЭта зависимость представляет собой другое, эквивалентное первому, выражение содержания закона Бойля — Мариотта. Она означает, что: \n\n ```Давление некоторой массы газа, находящегося при постоянной температуре, обратно пропорционально его объёму.``` \n\nТогда связь начального и конечного состояний газа, участвовавшего в изотермическом процессе, можно выразить в виде: \n\n${\\displaystyle {\\frac {p_{1}}{p_{2}}}={\\frac {V_{2}}{V_{1}}}}$\n\n"
      },
      {
        "id": 14,
        "name": "Закон Гей-Люссака",
        "additional": "",
        "data": "Закон пропорциональной зависимости объёма газа от абсолютной температуры при постоянном давлении (то есть в изобарном процессе), названный в честь французского физика и химика Жозефа Луи Гей-Люссака, впервые опубликовавшего его в 1802 году.\n\nЗакон Гей-Люссака в современной формулировке утверждает, что при постоянном давлении объём постоянной массы газа пропорционален абсолютной температуре. Математически закон выражается следующим образом: \n\n${\\displaystyle V\\sim T}$ или ${\\displaystyle {\\frac {V}{T}}=\\mathrm {const}}$  ,  $P=const$ \n\nгде ${\\displaystyle V}$ — объём газа, $T$ — температура, $P$ — давление. \n\nЕсли известно состояние газа при неизменном давлении и двух разных температурах, закон может быть записан в следующей форме: \n\n${\\displaystyle {\\frac {V_{1}}{T_{1}}}={\\frac {V_{2}}{T_{2}}}}$ или ${\\displaystyle {V_{1}}{T_{2}}={V_{2}}{T_{1}}}$\n"
      },
      {
        "id": 15,
        "name": "Законы Дальтона",
        "additional": "",
        "data": "Два физических закона, сформулированы Джоном Дальтоном в начале XIX века:\n\n- *1-й закон* — закон парциальных давлений смесей газов определяющих суммарное давление (открыт в 1801 г. и описан в 1802 г.) \n\n- *2-й закон* — относительной растворимости смеси газов в жидкости, иногда этот закон называют закон Генри — Дальтона.\n\n#### Закон о суммарном давлении смеси газов\n\n```Давление смеси химически не взаимодействующих идеальных газов равно сумме их парциальных давлений.```\n\n${\\displaystyle P=\\sum _{i=1}^{n}{p_{i}}=p_{1}+p_{2}+\\cdots +p_{n}.}$\n\n#### Закон о растворимости компонентов газовой смеси\n\n```При постоянной температуре растворимость в данной жидкости каждого из компонентов газовой смеси, находящейся над жидкостью, пропорциональна их парциальному давлению.```\n\n${\\displaystyle \\ m_{i}={\\frac {p_{i}}{P}}.}$\n\n"
      },
      {
        "id": 16,
        "name": "Первый закон термодинамики",
        "additional": "",
        "data": "Один из основных законов этой дисциплины, представляющий собой конкретизацию общефизического закона сохранения энергии для термодинамических систем, в которых необходимо учитывать *термические, массообменные и химические* процессы. \n\nВ форме закона сохранения (уравнения баланса энергии) первый закон используют в термодинамике потока и в неравновесной термодинамике. \n\nВ равновесной термодинамике под первым законом термодинамики обычно подразумевают одно из следствий закона сохранения энергии, из чего проистекает отсутствие единообразия формулировок первого начала, используемых в учебной и научной литературе.\n\nСообщенное системе количество теплоты расходуется на совершение системой работы против внешних сил и изменение внутренней энергии системы. Если работу совершают внешние по отношению к системе тела, то работа газа считается отрицательной, работа внешних тел положительной  $А = - A'$ \n\nЗакон сохранения энергии, записанный применительно к термодинамической системе, выглядит следующим образом:\n\n ### $Q=A'+\\Delta  U$ ### \n\nгде $Q$ – количество теплоты, переданное системе,\n\n $A'$ – работа системы (газа),\n\n $\\Delta U$ – изменение внутренней энергии системы (газа)."
      },
      {
        "id": 17,
        "name": "Второй закон термодинамики",
        "additional": "",
        "data": "Один из основных законов термодинамики, согласно которому *невозможен периодический процесс единственным результатом которого является совершение работы, эквивалентной количеству теплоты, полученному от нагревателя*. \n\n*Другая формулировка*: невозможен процесс, единственным результатом которого является передача энергии в форме теплоты от менее нагретого тела к более нагретому.\n\nЗакон выражает стремление системы, состоящей из большого количества хаотически движущихся частиц, к самопроизвольному переходу из состояний менее вероятных в состояния более вероятные. Запрещает создание вечного двигателя второго рода.\n\n*Второе начало термодинамики, также как и первое, представляет собой обобщение общечеловеческого опыта.*\n\nОпыт показывает, что теплота и работа, являющиеся, по определению, формами передачи энергии, неравноценны. Если работа $A$ может непосредственно переходить в теплоту, например, посредством трения, и при этом изменяется состояние одного тела, то количество теплоты $Q$ таким свойством не обладает. Подвод тепла приводит лишь к увеличению внутренней энергии системы, т. е. к увеличению её параметров, таких как температура, давление, объём и т.д. \n\nТермодинамическая работа, произведённая за счёт переданного количества теплоты, может быть получена лишь опосредственно, путём изменения вышеуказанных параметров (например, работа расширения рабочего тела). При этом, кроме охлаждения самого источника тепла, в случае незамкнутого процесса, происходит изменение термодинамического состояния одного (рабочего) тела, а в случае замкнутого процесса ─ нескольких тел, которым рабочее тело должно передать часть полученного тепла. \n\nВ тепловом двигателе получателем теплоты является холодильник. Процесс отдачи части тепла другим телам называется компенсацией. Как показывает опыт, невозможно превратить теплоту в работу без компенсации, являющейся ценой, которую надо заплатить за это превращение. \n\nПоясним на примере. Работа в тепловых двигателях производится путём расширения рабочего тела. Чтобы сделать работу машины непрерывной, рабочее тело необходимо вернуть в исходное состояние. С этой целью его надо сжать, затратив работу. Если сжатие производить при той же температуре, что и расширение, то потребуется затратить всю работу, полученную при расширении, и эффективность этого двигателя будет равна нулю. Чтобы работа сжатия была меньше работы расширения, необходимо производить сжатие при более низкой температуре. Для понижения температуры рабочего тела следует часть теплоты передать третьему телу – холодильнику. \n\nКоэффициент полезного действия теплового двигателя, по определению, равен отношению количества теплоты, превращённой в положительную работу за один цикл, ко всему подведённому к рабочему телу количеству теплоты.\n\n  ${\\displaystyle \\eta ={\\frac {Q_{1}-Q_{2}}{Q_{1}}}=1-{\\frac {Q_{2}}{Q_{1}}}={\\frac {A}{Q_{1}}}}$ \n\nгде $Q_1$ ─ количество теплоты, полученное от нагревателя, ${\\displaystyle Q_{2}}$ ─ количество теплоты, отданное холодильнику, $A$ ─ термодинамическая работа."
      }
    ]
  },
  {
    "name": "Электричество и магнетизм",
    "id": 18,
    "children":
    [
      {
        "id": 19,
        "name": "Закон Джоуля — Ленца",
        "additional": "Основной закон, описывающий тепловое действие электрического тока",
        "data": "Физический закон, дающий количественную оценку теплового действия электрического тока. Установлен в 1841 году Джеймсом Джоулем и независимо от него в 1842 году Эмилием Ленцем\n\nВ словесной формулировке звучит следующим образом:\n\n ```Мощность тепла, выделяемого в единице объёма среды при протекании постоянного электрического тока, равна произведению плотности электрического тока на величину напряженности электрического поля.```\n\nМатематически может быть выражен в следующей форме: \n\n${\\displaystyle w={\\vec {j}}\\cdot {\\vec {E}}=\\sigma E^{2}}$ \n\nгде $w$  — мощность выделения тепла в единице объёма,  ${\\displaystyle {\\vec {j}}}$ — плотность электрического тока,  $\\vec E$ — напряжённость электрического поля,  $σ$ — проводимость среды.\n\nЗакон также может быть сформулирован в интегральной форме для случая протекания токов в тонких проводах:\n\n```Количество теплоты, выделяемое в единицу времени в рассматриваемом участке цепи, пропорционально произведению квадрата силы тока на этом участке и сопротивления участка.```\n\nВ интегральной форме этот закон имеет вид:\n\n${\\displaystyle dQ=I^{2}Rdt}$\n\n${\\displaystyle Q=\\int \\limits _{t_{1}}^{t_{2}}I^{2}Rdt}$\n\nгде $dQ$ — количество теплоты, выделяемое за промежуток времени ${\\displaystyle dt}$,  $I$ — сила тока,  $R$ — сопротивление,  $Q$ — полное количество теплоты, выделенное за промежуток времени от $t_{1}$ до $t_{2}$.\n\nВ случае постоянных силы тока и сопротивления: \n\n${\\displaystyle Q=I^{2}Rt}$\n\nПрименяя закон Ома, можно получить следующие эквивалентные формулы: \n\n${\\displaystyle Q=U^{2}t/R\\ =IUt.}$\n"
      },
      {
        "id": 20,
        "name": "Закон Джоуля — Ленца",
        "additional": "",
        "data": ""
      },
      {
        "id": 21,
        "name": "Закон Джоуля — Ленца",
        "additional": "",
        "data": ""
      },
      {
        "id": 22,
        "name": "Закон Джоуля — Ленца",
        "additional": "",
        "data": ""
      },
      {
        "id": 23,
        "name": "Закон Джоуля — Ленца",
        "additional": "",
        "data": ""
      },
      {
        "id": 24,
        "name": "Закон Джоуля — Ленца",
        "additional": "",
        "data": ""
      },
      {
        "id": 25,
        "name": "Закон Джоуля — Ленца",
        "additional": "",
        "data": ""
      }
    ]}
]

