[
  {
    "name": "Механика",
    "id": 1,
    "children":
 [
  {
    "id": 2,
    "name": "Закон Архимеда",
    "diff": "2",
    "additional": "Закон test",
    "data": "\nЗакон гидро- и аэростатики: на тело, погруженное в жидкость или газ, действует выталкивающая сила, направленная вертикально вверх, числено равная весу жидкости или газа, вытесненного телом, и приложенная в центре тяжести погруженной части тела. \n\n ### $F_\\alpha = \\rho gV$\n\nгде $\\rho$ - плотность жидкости или газа, $V$ - объем погруженной части тела, $g$ - Ускорение свободного падения. \n\nИначе можно сформулировать так: тело, погруженное в жидкость или газ, теряет в своем весе столько, сколько весит вытесненная им жидкость (или газ). Открыт др. гр. ученым Архимедом в 212г. до н.э. Является основой теории плавания тел.\n\n"

  },
  {
    "id": 3,
    "name": "Закон всемирного тяготения",
    "additional": "",
    "data": "Закон, описывающий гравитационное взаимодействие в рамках классической механики. Этот закон был открыт Ньютоном около 1666 года, опубликован в 1687 году в «Началах» Ньютона.\n\nВсе тела притягиваются друг к другу с силой прямо пропорциональной произведению масс этих тел и обратно пропорциональной квадрату расстояния между ними: \n\n ### $F = G\\tfrac{M*m}{R^{2}}$ \n\n где $M$ и $m$ - массы взаимодействующих тел, $R$ - расстояние между этими телами, $G$- гравитационная постоянная \n\n  $G$ $=$ $6,67$ * $10^{-11}$ $H$м$^{2}$/кг$^{2}$"
  },
   {
     "id": 4,
     "name": "Закон сохранения импульса",
     "additional": "",
     "data": "Закон механики: *импульс* любой замкнутой системы при всех процессах, происходящих в системе, остается постоянным (сохраняется) и может только перераспределяться между частями системы в результате их взаимодействия.\n\nСоответственно, векторная сумма импульсов тел, образующих замкнутую систему, не меняется при любых взаимодействиях между телами системы.\n\n Импульс тела (материальной точки): \n\n ### $P = m\\nu$ \n\n Импульс системы тела равен векторной сумме импульсов каждого из тел системы: \n\n ### $p_{s} = \\sum_{i=1}^{N}(p_i)$ \n\n $⇒$  Закон сохранения импульса при неупругом ударе:\n ### $m_1\\nu_1+ m_2\\nu _2 = (m_1 + m_2)\\nu$ \n Закон сохранения импульса при упругом ударе:\n\n ### $m_1 \\nu_1+ m_2\\nu _2 = m_1\\nu _1{}' + m_2\\nu _2{}'$ \n\n"
   },
   {
     "id": 5,
     "name": "Закон Гука",
     "additional": "",
     "data": "Закон, согласно которому упругие *деформации* прямо пропорциональны вызывающим их внешним воздействиям.\n\nЗакон Гука выполняется только при малых деформациях. При превышении предела пропорциональности связь между силой и деформацией становится нелинейной. Для многих сред закон Гука неприменим даже при малых деформациях.\n\n **$⇒$**\n\nCила упругости, возникающая при деформации тела (растяжение или сжатие пружины), пропорциональна удлинению тела (пружины), и направлена в сторону противоположную направлению перемещений частиц тела\n\n ### $F=k*\\Delta l$ ### \n\nЗдесь $F$ — сила, которой растягивают (сжимают) стержень,  $\\Delta l$ — абсолютное удлинение (сжатие) стержня, а $k$  — коэффициент упругости (или жёсткости).\n\nЗакон Гука лежит в основе измерения сил пружинным механическим динамометром. В этом приборе измеряемая сила передаётся пружине, которая в зависимости от направления силы сжимается или растягивается. Величина упругой деформации пружины пропорциональна силе воздействия и регистрируется.\n\nПринципиальная возможность измерения обеспечивается уже свойством упругости, но без закона Гука упомянутая пропорциональность отсутствовала бы и градуировочная шкала стала бы неравномерной, что неудобно.\n\n"
   },
   {
     "id": 6,
     "name": "Первый закон Ньютона",
     "additional": "",
     "data": "Первый закон Ньютона постулирует существование инерциальных систем отсчёта. Поэтому он также известен как **закон инерции**. \n\nИнерция (она же инертность) — свойство тела сохранять скорость своего движения неизменной по величине и направлению, когда не действуют никакие силы, а также свойство тела сопротивляться изменению его скорости. \n\nЧтобы изменить скорость движения тела, необходимо приложить некоторую силу, причём результат действия одной и той же силы на разные тела будет различным: тела обладают разной инерцией (инертностью), величина которой характеризуется их массой.\n\nВ современной физике первый закон Ньютона принято формулировать в следующем виде:\n\n ```    Существуют такие системы отсчёта, называемые инерциальными, относительно которых материальные точки, когда на них не действуют никакие силы (или действуют силы взаимно уравновешенные), находятся в состоянии покоя или равномерного прямолинейного движения.```"
   },
   {
     "id": 7,
     "name": "Второй закон Ньютона",
     "additional": "",
     "data": "Второй закон Ньютона — дифференциальный закон движения, описывающий взаимосвязь между приложенной к материальной точке силой и получающимся от этого ускорением этой точки. \n\nФактически, второй закон Ньютона вводит массу как меру проявления инертности материальной точки в выбранной инерциальной системе отсчёта (ИСО). Масса материальной точки при этом полагается величиной постоянной во времени и независящей от каких-либо особенностей её движения и взаимодействия с другими телами\n\n ```В инерциальной системе отсчёта ускорение, которое получает материальная точка с постоянной массой, прямо пропорционально равнодействующей всех приложенных к ней сил и обратно пропорционально её массе.``` \n\n ### $\\vec{a}= \\frac{F}{m}$ ### \n\nгде  $\\vec{a}$ — ускорение материальной точки; $F$ — равнодействующая всех, приложенных к материальной точке;  $m$ — материальной точки.\n\nВторой закон Ньютона может быть также сформулирован в эквивалентной форме с использованием понятия импульс:\n\n *В инерциальной системе отсчёта скорость изменения импульса материальной точки равна равнодействующей всех приложенных к ней внешних сил.* \n\n $\\frac{d\\vec{p}}{dt} = \\vec{F}$ \n"
   },
   {
     "id": 8,
     "name": "Третий закон Ньютона",
     "additional": "",
     "data": "Этот закон описывает, как взаимодействуют две материальные точки. Пусть имеется замкнутая система, состоящая из двух материальных точек, в которой первая точка может действовать на вторую с некоторой силой  ${\\displaystyle {\\vec {F}}_{1\\to 2}}$ , а вторая — на первую с силой ${\\displaystyle {\\vec {F}}_{2\\to 1}}$. \n\nТретий закон Ньютона утверждает: сила действия ${\\displaystyle {\\vec {F}}_{1\\to 2}}$ равна по модулю и противоположна по направлению силе противодействия  ${\\displaystyle {\\vec {F}}_{2\\to 1}}$.\n\nЗакон утверждает, что силы возникают лишь попарно, причём любая сила, действующая на тело, имеет источник происхождения в виде другого тела. Иначе говоря, сила всегда есть результат *взаимодействия* тел. Существование сил, возникших самостоятельно, без взаимодействующих тел, невозможно\n\n ```Материальные точки взаимодействуют друг с другом силами, имеющими одинаковую природу, направленными вдоль прямой, соединяющей эти точки, равными по модулю и противоположными по направлению:```\n\n ### ${\\displaystyle {\\vec {F}}_{2\\to 1}} = -{\\displaystyle {\\vec {F}}_{1\\to 2}}$ ### \n\n\n"
   },
   {
     "id": 9,
     "name": "Принцип относительности Эйнштейна",
     "additional": "",
     "data": "Фундаментальный физический принцип, один из принципов симметрии, согласно которому все физические процессы в инерциальных системах отсчёта протекают *одинаково*, независимо от того, неподвижна ли система или она находится в состоянии равномерного и прямолинейного движения.\n\nОтсюда следует, что все законы природы одинаковы во всех инерциальных системах отсчёта. Частным случаем принципа относительности Эйнштейна является принцип относительности Галилея, который утверждает то же самое, но не для всех законов природы, а только для законов классической механики, подразумевая применимость преобразований Галилея и оставляя открытым вопрос о применимости принципа относительности к оптике и электродинамике.\n\nИз определения ускорения следует, что если движущаяся система отсчёта движется относительно первой без ускорения, то есть ${\\displaystyle \\ a_{o}=o}$, то ускорение ${\\displaystyle {\\vec {a}}}$ тела относительно обеих систем отсчёта одинаково. \n\nПоскольку в Ньютоновской динамике из кинематических величин именно ускорение играет основную роль, то все уравнения механики запишутся одинаково в любой инерциальной системе отсчёта — иначе говоря, законы механики не зависят от того, в какой из инерциальных систем отсчёта мы их исследуем, не зависят от выбора в качестве рабочей какой-либо конкретной из инерциальных систем отсчёта. Также — поэтому — не зависит от такого выбора системы отсчёта наблюдаемое движение тел (учитывая, конечно, начальные скорости). Это утверждение известно как принцип относительности Галилея, в отличие от Принципа относительности Эйнштейна.\n"
   }
 ]},
  {
  "name":"Молекулярная физика и Термодинамика",
    "id": 10,
    "children": [
      {
        "id": 11,
        "name": "Молекулярно-кинетическая теория (МКТ)",
        "additional": "теория, рассматривающая строение веществ, в основном газов",
        "data": "Теория строения вещества, базирующаяся на следующих положениях: вещество состоит из частиц ничтожно малых размеров, эти частицы находятся в непрерывном хаотическом (тепловом) движении и взаимодействуют друг с другом путём столкновений.\n\nМКТ стала одной из самых успешных физических теорий и была подтверждена целым рядом фактов. Основными доказательствами положений МКТ стали:\n\n- Диффузия\n- Броуновское движение\n- Изменение агрегатных состояний вещества\n \n\n \nНа основе МКТ развит целый ряд разделов современной физики, в частности, физическая кинетика и статистическая механика. В этих разделах физики изучаются не только молекулярные (атомные или ионные) системы, находящиеся не только в «тепловом» движении, и взаимодействующие не только через абсолютно упругие столкновения. Термин же молекулярно-кинетическая теория в современной теоретической физике уже практически не используется, хотя он встречается в учебниках по курсу общей физики.\n\n#### Основное уравнение МКТ\n\n${\\displaystyle p={\\frac {1}{3}}m_{0}nv^{2}}$ \nгде ${\\displaystyle m_{0}}$ — масса одной молекулы газа, $n$ — концентрация молекул, ${\\displaystyle v^{2}}$ — среднеквадратичная скорость молекул.\n\nРелятивистское выражение для этой формулы имеет следующий вид: \n\n${\\displaystyle p={\\frac {2\\rho c^{2}(\\gamma -1)}{3}}={\\frac {2\\rho c^{2}}{3}}\\left({\\frac {1}{\\sqrt {1-v^{2}/c^{2}}}}-1\\right)\\approx {\\frac {\\rho v^{2}}{3}}}$ \nгде ${\\displaystyle \\rho =m_{0}n}$ — плотность движущегося вещества, ${\\displaystyle c}$ — скорость света, ${\\displaystyle \\gamma ={\\frac {1}{\\sqrt {1-v^{2}/c^{2}}}}}$ — Лоренц-фактор.\n\n#### Уравнение среднеквадратичной скорости молекулы\n\nУравнение среднеквадратичной скорости молекулы легко выводится из основного уравнения МКТ для одного моля газа. \n\n${\\displaystyle E_{k}={\\frac {1}{2}}m{\\bar {v^{2}}}={\\frac {3}{2}}kT}$, \n\n${\\displaystyle N_{a}m=M_{r}}$, где ${\\displaystyle M_{r}}$ — молярная масса газа, ${\\displaystyle m}$ — масса молекулы газа.\n"
      },
      {
        "id": 12,
        "name": "Закон Авогадро",
        "additional": "",
        "data": "Закон, согласно которому в равных объёмах различных газов, взятых при одинаковых температурах и давлениях, содержится одно и то же количество молекул. В виде гипотезы был сформулирован в 1811 году Амедео Авогадро.\n\nГипотеза была подтверждена многочисленными экспериментальными исследованиями и поэтому стала называться *законом Авогадро*, став впоследствии  количественной основой современной химии и моллекулярной физики\n\nЗакон Авогадро точно выполняется для идеального газа, а для реальных газов он является тем более точным, чем газ более разреженный.\n\n#### Первое следствие из закона Авогадро\n\nодин моль (одинаковое количество молей) любого газа при одинаковых — изобарных и изотермических — условиях занимает одинаковый объём. Согласно закону Авогадро, одно и то же количество молекул любого газа занимает при одинаковых условиях один и тот же объём. С другой стороны, 1 моль любого вещества содержит (по определению) одинаковое количество частиц  (англ.)рус. (например, молекул). \n\nОтсюда следует, что при определённых температуре и давлении 1 моль любого вещества в газообразном состоянии занимает один и тот же объём. В частности, при нормальных условиях, то есть при 0 °C (273,15 К) и 101,325 кПа, объём 1 моля газа равен 22,413 962 ( $\\approx$ 13) л. \n\nЭту физическую константу называют стандартным молярным объёмом идеального газа и обозначают $V_m$. Найти молярный объём при других температуре и давлении можно с помощью уравнения Клапейрона: \n\n${\\displaystyle V_{\r {m}}={\\frac {RT}{p}}}$, где $R \\approx$ 8,314 Дж $/$ (моль $*$ К) — универсальная газовая постоянная.\n\n#### Второе следствие из закона Авогадро\n\nМолярная масса первого газа равна произведению молярной массы второго газа на относительную плотность первого газа ко второму. Это положение имело важное значение для развития химии, так как оно дает возможность определять молекулярную массу веществ, способных переходить в газообразное или парообразное состояние (см. Атомно-молекулярное учение).\n\nЕсли через μ обозначить молекулярную массу вещества и через ρ′ — его относительную плотность в газообразном состоянии, то отношение μ / ρ′ должно быть постоянным для всех веществ. Опыт показал, что для всех изученных веществ, переходящих в газообразное состояние без разложения, эта постоянная равна 28,9 а.е.м. (атомных единицы массы), если при определении относительную плотность исходить из плотности воздуха; но эта постоянная будет равняться 2 а.е.м., если принять за единицу плотность водорода. \n\nОбозначив эту постоянную, или, что то же, общее для всех газов отношение молекулярной массы к относительной плотности через $C$, мы из формулы имеем с другой стороны ${\\mu}' = {p}'C$. Так как относительная плотность $ρ'$ газа определяется легко, то, подставив её значение в формулу, можно вывести и неизвестную молекулярную массу данного вещества.\n\n"
      },
      {
        "id": 13,
        "name": "Закон Бойля — Мариотта",
        "additional": "",
        "data": "Один из основных газовых законов, экспериментально установленный в 1662 году Робертом Бойлем и независимо переоткрытый Эдмом Мариоттом в 1676 году. Описывает *поведение газа* в изотермическом процессе. С точки зрения современной физики закон представляет собой следствие уравнения Клапейрона — Менделеева.\n\nУтверждение закона Бойля — Мариотта состоит в следующем:\n\n```При постоянных температуре и массе газа произведение давления газа на его объём постоянно.```\n\nВ математической форме это утверждение записывается в виде формулы:\n\n${\\displaystyle pV=C}$\n\nгде ${\\displaystyle p}$ — давление газа; $V$ — объём газа, а $C$ — постоянная в оговоренных условиях величина. В общем случае значение $C$ определяется химической природой, массой и температурой газа.\n\nОчевидно, что если индексом 1 обозначить величины, относящиеся к начальному состоянию газа, а индексом 2 — к конечному, то приведённую формулу можно записать в виде:\n\n${\\displaystyle p_{1}V_{1}=p_{2}V_{2}}$.\n\nИз сказанного и приведённых формул следует вид зависимости давления газа от его объёма в изотермическом процессе: \n\n${\\displaystyle p={\\frac {C}{V}}}$ \n\nЭта зависимость представляет собой другое, эквивалентное первому, выражение содержания закона Бойля — Мариотта. Она означает, что: \n\n ```Давление некоторой массы газа, находящегося при постоянной температуре, обратно пропорционально его объёму.``` \n\nТогда связь начального и конечного состояний газа, участвовавшего в изотермическом процессе, можно выразить в виде: \n\n${\\displaystyle {\\frac {p_{1}}{p_{2}}}={\\frac {V_{2}}{V_{1}}}}$\n\n"
      },
      {
        "id": 14,
        "name": "Закон Гей-Люссака",
        "additional": "",
        "data": "Закон пропорциональной зависимости объёма газа от абсолютной температуры при постоянном давлении (то есть в изобарном процессе), названный в честь французского физика и химика Жозефа Луи Гей-Люссака, впервые опубликовавшего его в 1802 году.\n\nЗакон Гей-Люссака в современной формулировке утверждает, что при постоянном давлении объём постоянной массы газа пропорционален абсолютной температуре. Математически закон выражается следующим образом: \n\n${\\displaystyle V\\sim T}$ или ${\\displaystyle {\\frac {V}{T}}=\\mathrm {const}}$  ,  $P=const$ \n\nгде ${\\displaystyle V}$ — объём газа, $T$ — температура, $P$ — давление. \n\nЕсли известно состояние газа при неизменном давлении и двух разных температурах, закон может быть записан в следующей форме: \n\n${\\displaystyle {\\frac {V_{1}}{T_{1}}}={\\frac {V_{2}}{T_{2}}}}$ или ${\\displaystyle {V_{1}}{T_{2}}={V_{2}}{T_{1}}}$\n"
      },
      {
        "id": 15,
        "name": "Законы Дальтона",
        "additional": "",
        "data": "Два физических закона, сформулированы Джоном Дальтоном в начале XIX века:\n\n- *1-й закон* — закон парциальных давлений смесей газов определяющих суммарное давление (открыт в 1801 г. и описан в 1802 г.) \n\n- *2-й закон* — относительной растворимости смеси газов в жидкости, иногда этот закон называют закон Генри — Дальтона.\n\n#### Закон о суммарном давлении смеси газов\n\n```Давление смеси химически не взаимодействующих идеальных газов равно сумме их парциальных давлений.```\n\n${\\displaystyle P=\\sum _{i=1}^{n}{p_{i}}=p_{1}+p_{2}+\\cdots +p_{n}.}$\n\n#### Закон о растворимости компонентов газовой смеси\n\n```При постоянной температуре растворимость в данной жидкости каждого из компонентов газовой смеси, находящейся над жидкостью, пропорциональна их парциальному давлению.```\n\n${\\displaystyle \\ m_{i}={\\frac {p_{i}}{P}}.}$\n\n"
      },
      {
        "id": 16,
        "name": "Первый закон термодинамики",
        "additional": "",
        "data": "Один из основных законов этой дисциплины, представляющий собой конкретизацию общефизического закона сохранения энергии для термодинамических систем, в которых необходимо учитывать *термические, массообменные и химические* процессы. \n\nВ форме закона сохранения (уравнения баланса энергии) первый закон используют в термодинамике потока и в неравновесной термодинамике. \n\nВ равновесной термодинамике под первым законом термодинамики обычно подразумевают одно из следствий закона сохранения энергии, из чего проистекает отсутствие единообразия формулировок первого начала, используемых в учебной и научной литературе.\n\nСообщенное системе количество теплоты расходуется на совершение системой работы против внешних сил и изменение внутренней энергии системы. Если работу совершают внешние по отношению к системе тела, то работа газа считается отрицательной, работа внешних тел положительной  $А = - A'$ \n\nЗакон сохранения энергии, записанный применительно к термодинамической системе, выглядит следующим образом:\n\n ### $Q=A'+\\Delta  U$ ### \n\nгде $Q$ – количество теплоты, переданное системе,\n\n $A'$ – работа системы (газа),\n\n $\\Delta U$ – изменение внутренней энергии системы (газа)."
      },
      {
        "id": 17,
        "name": "Второй закон термодинамики",
        "additional": "",
        "data": "Один из основных законов термодинамики, согласно которому *невозможен периодический процесс единственным результатом которого является совершение работы, эквивалентной количеству теплоты, полученному от нагревателя*. \n\n*Другая формулировка*: невозможен процесс, единственным результатом которого является передача энергии в форме теплоты от менее нагретого тела к более нагретому.\n\nЗакон выражает стремление системы, состоящей из большого количества хаотически движущихся частиц, к самопроизвольному переходу из состояний менее вероятных в состояния более вероятные. Запрещает создание вечного двигателя второго рода.\n\n*Второе начало термодинамики, также как и первое, представляет собой обобщение общечеловеческого опыта.*\n\nОпыт показывает, что теплота и работа, являющиеся, по определению, формами передачи энергии, неравноценны. Если работа $A$ может непосредственно переходить в теплоту, например, посредством трения, и при этом изменяется состояние одного тела, то количество теплоты $Q$ таким свойством не обладает. Подвод тепла приводит лишь к увеличению внутренней энергии системы, т. е. к увеличению её параметров, таких как температура, давление, объём и т.д. \n\nТермодинамическая работа, произведённая за счёт переданного количества теплоты, может быть получена лишь опосредственно, путём изменения вышеуказанных параметров (например, работа расширения рабочего тела). При этом, кроме охлаждения самого источника тепла, в случае незамкнутого процесса, происходит изменение термодинамического состояния одного (рабочего) тела, а в случае замкнутого процесса ─ нескольких тел, которым рабочее тело должно передать часть полученного тепла. \n\nВ тепловом двигателе получателем теплоты является холодильник. Процесс отдачи части тепла другим телам называется компенсацией. Как показывает опыт, невозможно превратить теплоту в работу без компенсации, являющейся ценой, которую надо заплатить за это превращение. \n\nПоясним на примере. Работа в тепловых двигателях производится путём расширения рабочего тела. Чтобы сделать работу машины непрерывной, рабочее тело необходимо вернуть в исходное состояние. С этой целью его надо сжать, затратив работу. Если сжатие производить при той же температуре, что и расширение, то потребуется затратить всю работу, полученную при расширении, и эффективность этого двигателя будет равна нулю. Чтобы работа сжатия была меньше работы расширения, необходимо производить сжатие при более низкой температуре. Для понижения температуры рабочего тела следует часть теплоты передать третьему телу – холодильнику. \n\nКоэффициент полезного действия теплового двигателя, по определению, равен отношению количества теплоты, превращённой в положительную работу за один цикл, ко всему подведённому к рабочему телу количеству теплоты.\n\n  ${\\displaystyle \\eta ={\\frac {Q_{1}-Q_{2}}{Q_{1}}}=1-{\\frac {Q_{2}}{Q_{1}}}={\\frac {A}{Q_{1}}}}$ \n\nгде $Q_1$ ─ количество теплоты, полученное от нагревателя, ${\\displaystyle Q_{2}}$ ─ количество теплоты, отданное холодильнику, $A$ ─ термодинамическая работа."
      }
    ]
  },
  {
    "name": "Электричество и магнетизм",
    "id": 18,
    "children":
    [
      {
        "id": 19,
        "name": "Закон Джоуля — Ленца",
        "additional": "Основной закон, описывающий тепловое действие электрического тока",
        "data": "Физический закон, дающий количественную оценку теплового действия электрического тока. Установлен в 1841 году Джеймсом Джоулем и независимо от него в 1842 году Эмилием Ленцем\n\nВ словесной формулировке звучит следующим образом:\n\n ```Мощность тепла, выделяемого в единице объёма среды при протекании постоянного электрического тока, равна произведению плотности электрического тока на величину напряженности электрического поля.```\n\nМатематически может быть выражен в следующей форме: \n\n${\\displaystyle w={\\vec {j}}\\cdot {\\vec {E}}=\\sigma E^{2}}$ \n\nгде $w$  — мощность выделения тепла в единице объёма,  ${\\displaystyle {\\vec {j}}}$ — плотность электрического тока,  $\\vec E$ — напряжённость электрического поля,  $σ$ — проводимость среды.\n\nЗакон также может быть сформулирован в интегральной форме для случая протекания токов в тонких проводах:\n\n```Количество теплоты, выделяемое в единицу времени в рассматриваемом участке цепи, пропорционально произведению квадрата силы тока на этом участке и сопротивления участка.```\n\nВ интегральной форме этот закон имеет вид:\n\n${\\displaystyle dQ=I^{2}Rdt}$\n\n${\\displaystyle Q=\\int \\limits _{t_{1}}^{t_{2}}I^{2}Rdt}$\n\nгде $dQ$ — количество теплоты, выделяемое за промежуток времени ${\\displaystyle dt}$,  $I$ — сила тока,  $R$ — сопротивление,  $Q$ — полное количество теплоты, выделенное за промежуток времени от $t_{1}$ до $t_{2}$.\n\nВ случае постоянных силы тока и сопротивления: \n\n${\\displaystyle Q=I^{2}Rt}$\n\nПрименяя закон Ома, можно получить следующие эквивалентные формулы: \n\n${\\displaystyle Q=U^{2}t/R\\ =IUt.}$\n"
      },
      {
        "id": 20,
        "name": "Закон Ампера",
        "additional": "Закон взаимодействия электрических токов",
        "data": "Впервые был установлен Андре Мари Ампером в 1820 году для постоянного тока. Из закона Ампера следует, что параллельные проводники с электрическими токами, текущими в одном направлении, притягиваются, а в противоположных — отталкиваются. \n\nЗаконом Ампера называется также закон, определяющий силу, с которой магнитное поле действует на малый отрезок проводника с током. \n\nСила оказывается линейно зависимой как от тока, так и от магнитной индукции $B$ Выражение для силы $d{\\vec  F}$, с которой магнитное поле действует на элемент объёма $dV$ проводника с током плотности $\\vec j$, находящегося в магнитном поле с индукцией ${\\vec {B}}$, в Международной системе единиц (СИ) имеет вид: \n\n ### ${\\displaystyle {\\vec {F}}={\\vec {j}}\\times {\\vec {B}}dV}$ ###\n\nПод законом Ампера понимается совокупность утверждений и формул, характеризующих силовое воздействие на токонесущий проводник со стороны магнитного поля — возможно, созданного другим токонесущим проводником. \n\nЗакон определяет:\n\n- силу воздействия малого отрезка проводника:\n  \n  ${\\displaystyle dl_{1}}$ с током ${\\displaystyle I_{1}}$ на другой малый отрезок ${\\displaystyle dl_{2}}$ с током ${\\displaystyle I_{2}}$: \n ${\\displaystyle d^{2}{\\vec {F}}_{12}={\\frac {\\mu _{0}I_{1}I_{2}}{4\\pi }}\\cdot {\\frac {d{\\vec {l}}_{2}\\times [d{\\vec {l}}_{1}\\times ({\\vec {r}}_{2}-{\\vec {r}}_{1})]}{|{\\vec {r}}_{1}-{\\vec {r}}_{2}|^{3}}}=I_{2}d{\\vec {l}}_{2}\\times d{\\vec {B}}_{1}({\\vec {r}}_{2})}$ \n  \n  где ${\\displaystyle {\\vec {r}}_{1}}$ и ${\\displaystyle {\\vec {r}}_{2}}$ — радиус-векторы элементов длины проводников ${\\displaystyle d{\\vec {l}}_{1}}$ и ${\\displaystyle d{\\vec {l}}_{2}}$, а ${\\displaystyle d^{2}{\\vec {F}}_{12}}$ — сила действия элемента ${\\displaystyle d{\\vec {l}}_{1}}$ (создающего поле ${\\displaystyle d{\\vec {B}}_{1}({\\vec {r}}_{2})}$ в точке ${\\displaystyle {\\vec {r}}_{2}}$) на элемент ${\\displaystyle d{\\vec {l}}_{2}}$; ${\\displaystyle \\mu _{0}}$ — магнитная постоянная;\n\n- силу взаимодействия двух проводящих замкнутых контуров формы ${\\displaystyle C_{1}}$ и $C_{2}$ с токами ${\\displaystyle I_{1}}$ и ${\\displaystyle I_{2}}$:\n ${\\displaystyle F_{12}={\\mu _{0}I_{1}I_{2} \\over 4\\pi }\\oint \\limits _{\\mathbb {C} _{2}}\\oint \\limits _{\\mathbb {C} _{1}}{\\frac {[\\mathrm {d} r _{2},[\\mathrm {d} r _{1},r _{2}-r _{1}]]}{|r _{1}-r _{2}|^{3}}}}$ \nгде ${\\displaystyle r _{1}}$ и ${\\displaystyle r _{2}}$ — радиус-векторы, пробегающие все точки контуров ${\\displaystyle C_{1}}$, ${\\displaystyle C_{2}}$, а ${\\displaystyle F _{12}}$ — сила, с которой контур-1 действует на контур-2. По сути, это интегрирование выражения из предыдущего пункта;\n\n\n- силу, с которой магнитное поле действует на отрезок проводника ${\\displaystyle dl}$ с током ${\\displaystyle I}$ (A), плоский участок ${\\displaystyle dS}$ с током $\\vec{i}$ (А/м) или малый объём ${\\displaystyle dV}$ с током ${\\displaystyle {\\vec {j}}}$ (А/м2):  \n ${\\displaystyle d{\\vec {F}}=Id{\\vec {l}}\\times {\\vec {B}},\\quad d{\\vec {F}}={\\vec {i}}dS\\times {\\vec {B}},\\quad d{\\vec {F}}={\\vec {j}}dV\\times {\\vec {B}}}$ \n  \n  Направление силы ${\\displaystyle d{\\vec {F}}}$ определяется по правилу вычисления векторного произведения. Её модуль в случае провода находится как ${\\displaystyle dF=IBdl\\sin \\alpha }$, где $\\alpha$  — угол между ${\\displaystyle {\\vec {B}}}$ и направлением тока. Сила максимальна, когда проводник перпендикулярен линиям магнитной индукции (${\\displaystyle \\alpha =90^{\\circ }}$). Интегрирование позволит получить силу воздействия поля на объект в целом.\n"
      },
      {
        "id": 21,
        "name": "Закон сохранения электрического заряда",
        "additional": "",
        "data": "Закон физики, утверждающий, что алгебраическая сумма зарядов электрически замкнутой системы *сохраняется*: ${\\displaystyle q_{1}+q_{2}+q_{3}+......+q_{n}=const}$ \n\nЗакон сохранения заряда выполняется абсолютно всегда. На данный момент его происхождение объясняют следствием принципа калибровочной инвариантности. Требование релятивистской инвариантности приводит к тому, что закон сохранения заряда имеет локальный характер: изменение заряда в любом наперёд заданном объёме равно потоку заряда через его границу. \n\nВ изначальной формулировке был бы возможен следующий процесс: заряд исчезает в одной точке пространства и мгновенно возникает в другой. Однако такой процесс был бы релятивистски неинвариантен: из-за относительности одновременности в некоторых системах отсчёта заряд появился бы в новом месте до того, как исчез в предыдущем, а в некоторых — заряд появился бы в новом месте спустя некоторое время после исчезновения в предыдущем. То есть был бы отрезок времени, в течение которого заряд не сохраняется. \n\nПравила Кирхгофа для токов напрямую следуют из закона сохранения заряда. Объединение проводников и радиоэлектронных компонентов представляется в виде незамкнутой системы. Суммарный приток зарядов в данную систему *равен* суммарному выходу зарядов из системы. В правилах Кирхгофа предполагается, что электронная система не может значительно изменять свой суммарный заряд.\n\nТребование локальности позволяет записать закон сохранения заряда в дифференциальной и интегральной форме."
      },
      {
        "id": 22,
        "name": "Закон Кулона",
        "additional": "Основной закон электростатики",
        "data": "Закон, описывающий взаимодействие между двумя неподвижными точечными электрическими зарядами в вакууме.\nОткрыт Шарлем Кулоном в 1785 году. Проведя большое количество опытов с металлическими шариками, Кулон дал такую формулировку закона: \n\n ```Модуль силы взаимодействия двух точечных зарядов в вакууме прямо пропорционален произведению модулей этих зарядов и обратно пропорционален квадрату расстояния между ними. ``` \n\nСовременная формулировка: \n\n ```Сила взаимодействия двух точечных зарядов в вакууме направлена вдоль прямой, соединяющей эти заряды, пропорциональна их величинам и обратно пропорциональна квадрату расстояния между ними. Она является силой притяжения, если знаки зарядов разные, и силой отталкивания, если эти знаки одинаковы. ``` \n\nВ векторном виде в формулировке Ш. Кулона закон записывается как:\n\n### ${\\displaystyle {\\vec {F}}_{12}=k\\cdot {\\frac {q*{1}\\cdot q_{2}}{r_{12}^{2}}}\\cdot {\\frac {{\\vec {r}}_{12}}{r_{12}}}}$\n\nгде $\\vec{F}_{12}$ — сила, с которой заряд 1 действует на заряд 2;  ${\\displaystyle q_{1},q_{2}}$ — величина зарядов (со знаком);  ${\\displaystyle {\\vec {r}}_{12}}$ — вектор, направленный от заряда 1 к заряду 2 и по модулю равный расстоянию между зарядами $({\\displaystyle r_{12}})$; $k$ — коэффициент пропорциональности.\n\nПолная формула нахрждения силы:\n\n${\\displaystyle {\\vec {F}}_{12}={\\frac {1}{4\\pi \\varepsilon _{0}}}\\cdot {\\frac {q_{1}q_{2}({\\vec {r}}_{2}-{\\vec {r}}_{1})}{|{\\vec {r}}_{2}-{\\vec {r}}_{1}|^{3}}}}$\n\nгде ${\\displaystyle |{\\vec {r}}_{2}-{\\vec {r}}_{1}|=r_{12}}$ — расстояние между зарядами,  ${\\displaystyle {\\vec {r}}_{1}}$, ${\\displaystyle {\\vec {r}}_{2}}$ — их радиус-векторы, а  ${\\displaystyle \\varepsilon _{0}}$ — электрическая постоянная. По величине, ${\\displaystyle F_{12}=q_{1}q_{2}/(4\\pi \\varepsilon _{0}r_{12}^{2})}$ \n\nТакже под законом Кулона понимается формула для вычисления электрического поля точечного заряда, вместе с её обобщением на произвольное распределение зарядов в пространстве: \n\n${\\displaystyle {\\vec {E}}({\\vec {r}}_{0})={\\frac {1}{4\\pi \\varepsilon _{0}}}\\int _{V}{\\frac {({\\vec {r}}_{0}-{\\vec {r}})\\rho ({\\vec {r}})\\,dV}{|{\\vec {r}}_{0}-{\\vec {r}}|^{3}}}}$ \n\nЗдесь ${\\vec  {r}}_{0}$ — радиус-вектор точки, в которой определяется поле, а  ${\\vec {r}}$ — радиус-вектор элемента объёма ${\\displaystyle dV}$, заряд ${\\displaystyle dq=\\rho dV}$( $\\rho$  — плотность заряда) которого даёт вклад в поле.\n"
      },
      {
        "id": 23,
        "name": "Правило Ленца",
        "additional": "",
        "data": "Правило, определяющее направление индукционных токов, возникающих при электромагнитной индукции. \n\n ```Индукционный ток всегда имеет такое направление, что его собственный магнитный поток компенсирует изменения внешнего магнитного потока, вызвавшие этот ток. Правило Ленца - следствие закона сохранения энергии.``` \n\n![image size](https://fizmat.teachua.com/wp-content/uploads/2018/05/762cda646e0ad0841a58b512b9ccb008.png =380x)![image size](https://fizmat.teachua.com/wp-content/uploads/2018/05/3b74e0db34043a70c4fe72f666b582a8.png =380x)"
      },
      {
        "id": 24,
        "name": "Закон Ома",
        "additional": "Один из основных законов электрического тока",
        "data": "Эмпирический физический закон, определяющий *связь электродвижущей силы источника* (или электрического напряжения) *с силой тока*, протекающего в проводнике, и сопротивлением проводника. Установлен Георгом Омом в 1826 году и назван в его честь. \n\n#### Формулировка Закона Ома\n\nВ своей работе Ом записал закон в следующем виде:\n\n ### ${\\displaystyle X\\!={a \\over {b+l}}}$  (1) ### \n\nгде: \n\n- X — показания гальванометра (в современных обозначениях, сила тока I);\n\n- a — величина, характеризующая свойства источника напряжения, постоянная в широких пределах и не зависящая от величины тока (в современной терминологии, электродвижущая сила (ЭДС) ε); \n\n- l — величина, определяемая длиной соединяющих проводов (в современных представлениях соответствует сопротивлению внешней цепи R); \n\n- b — параметр, характеризующий свойства всей электрической установки (в современных представлениях, параметр, в котором можно усмотреть учёт внутреннего сопротивления источника тока r).\n\nФормула (1) при использовании современных терминов выражает закон Ома для полной цепи: \n\n ### ${\\displaystyle I\\!={\\varepsilon \\! \\over {R+r}}}$ (2) ### \n\nгде:\n\n- $\\varepsilon$ — ЭДС источника напряжения, В;\n\n- $I$ — сила тока в цепи, А;\n\n- ${\\displaystyle R}$ — сопротивление всех внешних элементов цепи, Ом;\n\n- $r$ — внутреннее сопротивление источника напряжения, Ом.\n\nИз закона Ома для полной цепи вытекают следующие следствия: \n\n- при ${\\displaystyle r\\ll R}$ сила тока в цепи обратно пропорциональна её сопротивлению, а сам источник в ряде случаев может быть назван источником напряжения; \n\n- при ${\\displaystyle r\\gg R}$ сила тока не зависит от свойств внешней цепи (от величины нагрузки), и источник может быть назван источником тока.\n\nЧасто выражение ${\\displaystyle U\\!=IR}$  (3), где $U$ есть напряжение, или падение напряжения (или, что то же, разность потенциалов между началом и концом участка проводника), тоже называют «законом Ома». Таким образом, электродвижущая сила в замкнутой цепи, по которой течёт ток в соответствии с (2) и (3) равняется:\n\n ${\\displaystyle {\\varepsilon}=Ir+IR=U(r)+U(R)}$ (4). \n\nТо есть сумма падений напряжения на внутреннем сопротивлении источника тока и на внешней цепи равна ЭДС источника. Последний член в этом равенстве специалисты называют «напряжением на зажимах», поскольку именно его показывает вольтметр, измеряющий напряжение источника между началом и концом присоединённой к нему замкнутой цепи. В таком случае оно всегда меньше ЭДС. \n\nК другой записи формулы (3), а именно:\n\n ${\\displaystyle I\\!={U \\over R}}$  (5)\n\nприменима другая формулировка: \n\n ```Сила тока в участке цепи прямо пропорциональна напряжению и обратно пропорциональна электрическому сопротивлению данного участка цепи.``` \n\nВыражение (5) можно переписать в виде:\n\n${\\displaystyle I\\!={UG}}$  (6)\n\nгде коэффициент пропорциональности $G$ назван проводимость или электропроводность.\n\n#### Закон Ома для переменного тока\n\nВышеприведённые соображения о свойствах электрической цепи при использовании источника (генератора) с переменной во времени ЭДС остаются справедливыми. Специальному рассмотрению подлежит лишь учёт специфических свойств потребителя, приводящих к разновременности достижения напряжением и током своих максимальных значений, то есть учёт фазового сдвига. \n\nЕсли ток является синусоидальным с циклической частотой ω, а цепь содержит не только активные, но и реактивные компоненты (ёмкости, индуктивности), то закон Ома обобщается; величины, входящие в него, становятся комплексными: \n\n ### ${\\displaystyle \\mathbb {U} =\\mathbb {I} \\cdot \\mathbb {Z}}$ ### \n\nгде: \n\n- ${\\displaystyle \\mathbb {U} =U_{0}e^{i\\omega t}}$ — комплексное напряжение или разность потенциалов, \n\n- ${\\displaystyle \\mathbb {I} }$ — комплексная сила тока, \n\n- ${\\displaystyle \\mathbb {Z} =Re^{-i\\delta }}$ — комплексное сопротивление (электрический импеданс), \n\n- $R = \\sqrt{R_a^{2}+R_r^{2}}$ — полное сопротивление (модуль импеданса), \n\n- $R_r = \\omega L - \\frac{1}{\\omega C}$ — реактивное сопротивление (разность индуктивного и емкостного), \n\n- $R_a$ — активное (омическое) сопротивление, не зависящее от частоты, \n\n- $\\delta=-arctg(\\frac {R_r}{R_a})$ — сдвиг фаз между напряжением и силой тока (фаза импеданса, с точностью до обратного знака). \n\nПри этом переход от комплексных переменных в значениях тока и напряжения к действительным (измеряемым) значениям может быть произведён взятием действительной или мнимой части (но во всех элементах цепи одной и той же!) комплексных значений этих величин. \n\nСоответственно, обратный переход строится для, к примеру, ${\\displaystyle U=U_{0}\\sin(\\omega t+\\varphi )}$ подбором такой ${\\displaystyle \\mathbb {U} =U_{0}e^{i(\\omega t+\\varphi )}}$ , что  ${\\displaystyle {I_m} \\mathbb {U} =U}$.Тогда все значения токов и напряжений в схеме надо считать как ${\\displaystyle F={I_m} \\mathbb {F}}$\n\n"
      },
      {
        "id": 26,
        "name": "Законы электролиза Фарадея",
        "additional": "Основные законы электролиза",
        "data": "Законы электро́лиза Фараде́я являются количественными соотношениями, основанными на электрохимических исследованиях, опубликованных Майклом Фарадеем в 1836 году\n\nСмысл законов электролиза сводится к тому, что вещество имеет атомную или молекулярную структуру, а атомы или молекулы определенного химического вещества одинаковы и имеют следовательно одинаковую массу, то же относится к ионам, играющим роль переносчиков тока в электролитах и разряжающимися (окисляющимися или восстанавливающимися) на электродах при электролизе. Кроме одинаковой массы ионы одинакового вида имеют и одинаковый заряд, который дискретен и всегда кратен заряду электрона (хотя для разных ионов может иметь разный знак).\n\nТаким образом, при прохождении через электрод определенного количества электричества это означает прохождение и строго определенного количества электронов, и разрядку на нем строго определенного количество ионов определенного типа (равного количеству прошедших электронов, деленному на заряд данного типа иона). И, таким образом, зная массу данного типа атомов, молекул или ионов, и величину элементарного заряда (заряда электрона), прямо устанавливается пропорциональная зависимость между прошедшим через электрод количеством электричества и массой выделившегося на нем вещества.\n\nГоворя коротко, физический смысл законов Фарадея с современной точки зрения сводится к закону сохранения электрического заряда в сочетании с фактом дискретности заряда и фактом физической одинаковости (в том числе всегда одинаковой массы).\n\n #### Первый закон электролиза Фарадея: #### \n\nМасса вещества, осаждённого на электроде при электролизе, прямо пропорциональна количеству электричества, переданного на этот электрод. Под количеством электричества имеется в виду суммарный электрический заряд, прошедший через поверхность электрода. Выражается формулой:\n\n${\\displaystyle m=kQ}$\n\nгде $k$ - коэффициент пропорциональности.\n\n #### Второй закон электролиза Фарадея: #### \n\nДля данного количества электричества (электрического заряда) масса химического элемента или вещества, выделившегося на электроде, прямо пропорциональна эквивалентной массе элемента или вещества. Эквивалентной массой вещества вообще в химии называется его молярная масса, делённая на целое число, зависящее от химической реакции, в которой участвует вещество; в данном же случае эквивалентом называется молярная масса образующегося при разряде иона вещества, деленная на сумму зарядов ионов (измеренных в элементарных единицах), дающих в итоге молекулу или атом данного вещества. В случае выделения на электроде атомарного вещества эквивалент - это просто его атомная масса, деленная на заряд его иона.\n\nЗаконы Фарадея можно записать в виде следующей формулы:\n\n ### ${\\displaystyle m\\ =\\ \\left({Q \\over F}\\right)\\left({M \\over z}\\right)}$ ### \n\nгде:\n\n- $m$ — масса осаждённого на электроде вещества,\n  \n- $Q$ — полный электрический заряд, прошедший через вещество ${\\displaystyle F=96\\,485,33(83)}$ Кл $*$ моль$^{-1}$ — постоянная Фарадея,\n  \n- $M$— молярная масса иона,\n  \n- $z$ — валентное число ионов вещества (число избыточных или недостающих электронов на один ион).\n  \n\nЗаметим, что ${\\frac {M}{z}}$ — это эквивалентная масса осаждённого вещества.\n\nДля первого закона Фарадея ${\\displaystyle M,\\,F}$ и $z$ являются константами, так что, чем больше величина $Q$, тем больше будет величина $m$.\n\nДля второго закона Фарадея ${\\displaystyle Q,\\,F}$ и $z$ являются константами, так что чем больше величина ${\\frac {M}{z}}$ (эквивалентная масса), тем больше будет величина $m$."
      },
      {
        "id": 27,
        "name": "Закон электромагнитной индукции Фарадея",
        "additional": "Основной закон электродинамики",
        "data": "Закон электромагнитной индукции Фарадея является основным законом электродинамики, касающимся принципов работы трансформаторов, дросселей, многих видов электродвигателей и генераторов. \n\nЗакон гласит: \n\n ```Для любого контура индуцированная электродвижущая сила (ЭДС) равна скорости изменения магнитного потока, проходящего через этот контур, взятой со знаком минус. ``` \n\nили другими словами: \n\n ```Генерируемая ЭДС пропорциональна скорости изменения магнитного потока.``` \n\nПри этом индукционный ток направлен таким образом, что его действие противоположно действию причины, вызвавшей этот ток (правило Ленца).\n\nЗакон электромагнитной индукции Фарадея использует понятие магнитного потока Φ$_B$ через поверхность $\\Sigma$ , который определён через поверхностный интеграл: \n\n${\\displaystyle \\Phi =\\iint \\limits _{S} {B} \\cdot d {S}}$ \n\nгде $dS$ — площадь элемента поверхности $\\Sigma (t)$, $B$ — магнитное поле, а $B·dS$ — скалярное произведение $B$ и $dS$. Предполагается, что поверхность имеет «устье», очерченное замкнутой кривой, обозначенной $\\delta \\Sigma(t)$. \n\nЗакон индукции Фарадея утверждает, что когда поток изменяется, то при перемещении единичного положительного пробного заряда по замкнутой кривой ∂Σ возникает ЭДС ${\\displaystyle {\\mathcal {E}}}$, величина которой определяется по формуле: \n\n${\\displaystyle |{\\mathcal {E}}|=\\left|{{d\\Phi } \\over dt}\\right|\\ }$ \n\nгде ${\\mathcal  {E}}$ — величина электродвижущей силы (ЭДС) в вольтах, а Φ$_B$ — магнитный поток в веберах. Направление электродвижущей силы определяется законом Ленца. \n\nДля плотно намотанной катушки индуктивности, содержащей $N$ витков, каждый с одинаковым магнитным потоком Φ$_B$, закон индукции Фарадея утверждает, что: \n\n${\\displaystyle |{\\mathcal {E}|}=N\\left|{{d\\Phi _{B}} \\over dt}\\right|}$ \n\nгде $N$ — число витков провода, Φ$_B$ — магнитный поток в веберах на один виток. Выбираемый путь ∂Σ(t) для нахождения ЭДС должен удовлетворять двум основным требованиям: (1) путь должен быть замкнутым, и (2) путь должен охватывать относительное движение частей контура (источник происхождения t-зависимости в ∂Σ(t)). \n\nК требованиям не относится то, что путь должен совпадать с линией тока, но, конечно, ЭДС, которая находится по закону потока, будет считаться по выбранному пути. Если путь не совпадает с линией тока, то подсчитанная ЭДС, возможно, будет не та ЭДС, которая вызывает ток."
      }
    ]},
  {
    "name": "Оптика",
    "id": 28,
    "children":
    [
      {
        "id": 29,
        "name": "Преломление (рефракция) света",
        "additional": "",
        "data": "Явление изменения направления луча (волны), возникающее на границе двух сред, через которые этот луч проходит, или в одной среде, но с меняющимися свойствами, в которой скорость распространения волны неодинакова. \n\nФеномен преломления объясняется законами сохранения энергии и сохранения импульса. При изменении передающей среды изменяется скорость волны, а её частота остаётся такой же. Преломление света через стекло или воду — наиболее простой и очевидный пример искажения луча, но законы преломления действительны для любых волн, — электромагнитных, акустических и даже морских. В общем случае закон преломления описывается «Законом Снеллиуса». \n\nТермины «рефракция» и «преломление» взаимозаменяемы; традиционно термин «рефракция» чаще употребляется для описания излучения в средах, показатель преломления в которых от точки к точке меняется плавно (траектория луча имеет вид плавно искривляющейся линии), в то время как термин «преломление» чаще используется для описания резкого изменения траектории луча на границе сред из-за высокой разницы в их показателях преломления. Действует при этом один и тот же закон — зависимость скорости волны от показателя преломления конкретной передающей среды. \n\nПреломление наблюдается, когда фазовые скорости электромагнитных волн в контактирующих средах различаются. В этом случае полное значение скорости волны должно быть разным по разные стороны границы раздела сред. Однако если проследить движение, например, гребня волны вдоль границы раздела — то соответствующая скорость должна быть одинаковой для обеих «половинок» волны.\n\n![image size](https://upload.wikimedia.org/wikipedia/commons/thumb/e/e7/Snells_law2-ru.svg/220px-Snells_law2-ru.svg.png =240x) \n\nИз простого геометрического построения получаем, что скорость движения точки пересечения гребня ${\\displaystyle v_{\\alpha }}$ с линией, наклонённой к направлению распространения волны под углом $\\alpha$ , будет равна:\n\n ### ${\\displaystyle v_{\\alpha }=v/\\sin \\alpha }$ ### \n\nгде $v$ — скорость распространения волны. \n\nЭто ясно из того, что, пока гребень волны пройдёт в направлении своего распространения (то есть перпендикулярно гребню) расстояние, равное катету треугольника, точка пересечения гребня с границей пройдёт расстояние, равное гипотенузе, а отношение этих расстояний, равное синусу угла, и есть отношение скоростей. \n\nТогда, приравняв скорости вдоль границы раздела для падающей и прошедшей волн, получим  —  ${\\displaystyle v_{1}/\\sin \\alpha =v_{2}/\\sin \\beta }$,  что эквивалентно закону Снелла, поскольку показатель преломления определяется как отношение скорости электромагнитного излучения в вакууме к скорости электромагнитного излучения в среде: \n\n${\\displaystyle n_{1}=c/v_{1},~n_{2}=c/v_{2}}$\n\nВ итоге на границе раздела двух сред наблюдается преломление луча, качественно состоящее в том, что углы к нормали к границе раздела сред для падающего и преломлённого луча отличаются друг от друга, то есть ход луча вместо прямого становится ломаным — луч преломляется. \n\nЗаметим, что практически тождественным способом вывода закона Снелла является построение прошедшей волны с помощью принципа Гюйгенса — Френеля. \n\nПри движении волны в средах с разными показателями преломления её частота сохраняется, а длина волны изменяется пропорционально скорости. \n\nВ изотропной среде для синусоидальной волны, характеризуемой частотой и волновым вектором, перпендикулярным направлению распространения волны, соображения, что составляющая волнового вектора, параллельная границе раздела, должна быть одинаковой до и после прохождения этой границы, приводят к такому же виду закона преломления.\n"
      },
      {
        "id": 30,
        "name": "Закон отражения волн",
        "additional": "",
        "data": "Формулы Френеля связывают амплитуды преломлённой и отражённой электромагнитных волн с амплитудой волны, падающей на плоскую границу раздела двух сред с разными показателями преломления. Названы в честь французского физика Огюста Френеля, получившего эти формулы. Отражение света, описываемое формулами Френеля, называется френелевским отражением.\n\nФормулы Френеля справедливы в том случае, когда граница раздела двух сред гладкая, среды изотропны, угол отражения равняется углу падения, а угол преломления определяется законом Снеллиуса. \n\nВ случае неровной поверхности, особенно когда характерные размеры неровностей одного порядка с длиной волны, большое значение имеет диффузное отражение света на поверхности.\n\n### Общий случай \n\n $r_{s}={\\frac {n_{1}\\cos \\theta_i - n_{2}\\cos\\theta_{t}}{n_{1}\\cos \\theta_{i}+n_{2}\\cos \\theta_{t}},}$ \n\n $t_{\\text{s}}={\\frac {2n_{1}\\cos \\theta _{\\text{i}}}{n_{1}\\cos \\theta _{\\text{i}}+n_{2}\\cos \\theta _{\\text{t}}}},$ \n\n $r_{\\text{p}}={\\frac {n_{2}\\cos \\theta _{\\text{i}}-n_{1}\\cos \\theta _{\\text{t}}}{n_{2}\\cos \\theta _{\\text{i}}+n_{1}\\cos \\theta _{\\text{t}}}},$ \n\n $t_{\\text{p}}={\\frac {2n_{1}\\cos \\theta _{\\text{i}}}{n_{2}\\cos \\theta _{\\text{i}}+n_{1}\\cos \\theta _{\\text{t}}}}.$ \n\nгде $n_{1}$ — показатель преломления среды, из которой падает волна, ${\\displaystyle n_{2}}$ — показатель преломления среды, в которую волна проходит, ${\\displaystyle \\theta _{i}}$ — угол падения, ${\\displaystyle \\theta _{t}}$— угол преломления. \n\nУгол падения связан с углом преломления законом Снеллиуса:\n\n ${\\displaystyle n_{1}\\sin \\theta _{i}=n_{2}\\sin \\theta _{t}}$ \n\nПоскольку свет с разными поляризациями по-разному отражается от поверхности, то отражённый свет всегда частично поляризован, даже если падающий свет неполяризован. При некотором угле падения, называемым углом Брюстера, отражённый луч оказывается полностью поляризован. Его поляризация оказывается линейной, перпендикулярной к плоскости падения (то есть выполняется условие ${\\displaystyle r_{p}=0}$. Угол Брюстера ${\\displaystyle \\theta _{B}}$ зависит от отношения показателей преломления сред, образующих границу раздела и может быть найден по формуле: \n\n${\\displaystyle {tg} \\theta _{B}={\\frac {n_{2}}{n_{1}}}}$\n\nКоэффициенты отражения и преломления по энергии могут быть рассчитаны по формулам: \n\n${\\displaystyle R=|r|^{2}}{\\displaystyle R=|r|^{2}} {\\displaystyle T={\\frac {n_{2}\\cos \\theta _{t}}{n_{1}\\cos \\theta _{i}}}|t|^{2}}$\n\n### Нормальное падение\n\nВ случае нормального падения света исчезает разница между p- и s-поляризованными волнами. Тогда амплитудные коэффициенты становятся равны: \n\n${\\displaystyle r_{s}=-r_{p}={\\frac {n_{1}-n_{2}}{n_{2}+n_{1}}},}$\n\n${\\displaystyle t_{s}=t_{p}={\\frac {2n_{1}}{n_{2}+n_{1}}}.}$ \n\nРазница в знаках $r_{s}$ и $r_{p}$ обусловлена выбором направлений векторов напряженности электрического поля: в случае p-поляризации в пределе нормального падения векторы падающей и отражённой волны оказываются направлены в противоположные стороны, а в случае s-поляризации остаются сонаправленными. \n\nКоэффициенты отражения и преломления по энергии: \n\n${\\displaystyle R=\\left|{\\frac {n_{2}-n_{1}}{n_{2}+n_{1}}}\\right|^{2},}$\n\n${\\displaystyle T={\\frac {4n_{1}n_{2}}{(n_{2}+n_{1})^{2}}}.}$"
      },
      {
        "id": 31,
        "name": "Принцип Гюйгенса — Френеля",
        "additional": "",
        "data": "Принцип Гюйгенса — Френеля — основной постулат волновой теории, описывающий и объясняющий механизм распространения волн, в частности, световых.\n\nПринцип Гюйгенса-Френеля является развитием принципа, который ввёл Христиан Гюйгенс в 1678 году: \n\nкаждая точка фронта (поверхности, достигнутой волной) является вторичным (то есть новым) источником сферических волн. Огибающая фронтов волн всех вторичных источников становится фронтом волны в следующий момент времени. \n\nПринцип Гюйгенса в таком виде объясняет распространение волн, согласующееся с законами геометрической оптики, но не может достаточно полно, а тем более количественно, объяснить явление дифракции. \n\nФренель в 1815 году дополнил принцип Гюйгенса, введя представления о когерентности и интерференции элементарных волн, что позволило рассматривать на основе принципа Гюйгенса — Френеля и дифракционные явления. \n\nПринцип Гюйгенса — Френеля формулируется следующим образом: \n ```Каждый элемент волнового фронта можно рассматривать как центр вторичного возмущения, порождающего вторичные сферические волны, а результирующее световое поле в каждой точке пространства будет определяться интерференцией этих волн.``` \n\n"
      }
  ]}
]

